---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFile.Create(Autodesk.Revit.DB.IFC.IFCFileModelOptions)
zh: 创建、新建、生成、建立、新增
source: html/ecfc7d57-22ef-d8f5-2eb2-b2d748c6a193.htm
---
# Autodesk.Revit.DB.IFC.IFCFile.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates an IFC file for exporting.

## Syntax (C#)
```csharp
public static IFCFile Create(
	IFCFileModelOptions modelOptions
)
```

## Parameters
- **modelOptions** (`Autodesk.Revit.DB.IFC.IFCFileModelOptions`) - The options.

## Returns
The IFC file.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null